cask_args appdir: '~/Applications'

tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

brew 'coreutils'
brew 'findutils'
brew 'git'
brew 'homebrew/dupes/openssh'
#brew 'php56', args: ['with-gmp', 'with-mcrypt']
brew 'imagemagick', args: ['with-webp']
brew 'node'
brew 'pass'
brew 'speedtest_cli'
brew 'unrar'
brew 'webkit2png'
brew 'wget', args: ['with-iri']
#brew 'woff2'

cask 'amazon-music'
cask 'atom'
cask 'caffeine'
cask 'calibre'
cask 'cleanmymac'
cask 'dash'
cask 'firefox'
cask 'franz'
cask 'google-chrome'
cask 'google-photos-backup'
cask 'imageoptim'
cask 'iterm2'
cask 'private-internet-access'
cask 'sequel-pro'
cask 'sketchup'
cask 'soundcloud-downloader'
cask 'spotify'
cask 'steam'
cask 'the-unarchiver'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
