cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'coreutils'
brew 'findutils'
brew 'git'
brew 'homebrew/php/php55', args: ['with-gmp', 'with-mcrypt']
brew 'imagemagick', args: ['with-webp']
brew 'node'
brew 'pass'
brew 'speedtest_cli'
brew 'unrar'
brew 'webkit2png'
brew 'wget', args: ['with-iri']
brew 'woff2'

cask 'amazon-music'
cask 'atom'
cask 'bittorrent-sync'
cask 'caffeine'
cask 'cleanmymac'
cask 'daisydisk'
cask 'dash'
cask 'dropletmanager'
cask 'fantastical'
cask 'firefox'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-hangouts'
cask 'imageoptim'
cask 'iterm2'
cask 'plex-media-player'
cask 'sequel-pro'
cask 'skype'
cask 'sonos'
cask 'soundcloud-downloader'
cask 'the-unarchiver'
cask 'transmit'
cask 'vagrant'
cask 'vagrant-bar'
cask 'virtualbox'
cask 'vlc'
