# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts
brew 'speedtest_cli'
brew 'webkit2png'
brew 'wget'
brew 'youtube-dl'

# Development
brew 'php'
brew 'php@8.1'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'yarn'

# Apps
cask '1password'
cask 'arc'
cask 'bartender'
cask 'betterdisplay'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'microsoft-teams'
cask 'pastebot'
cask 'phpstorm'
cask 'postman'
cask 'tableplus'
cask 'raycast'
cask 'sequel-ace'
cask 'slack'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmit'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Canary Mail - Email Meet AI', id: 1236045954
mas 'Magnet', id: 441258766
mas 'Bitwarden', id: 1352778147
mas 'Harvest', id: 506189836
